src/data_analysis/collected_data/orange/api/standarda8v2/h/load_read.txt
Running 30m test @ http://20.117.67.156:60/wrk2-api/home-timeline/read
  2 threads and 1000 connections
  Thread calibration: mean lat.: 739.650ms, rate sampling interval: 3991ms
  Thread calibration: mean lat.: 751.815ms, rate sampling interval: 3997ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    11.20m     6.62m   22.60m    57.55%
    Req/Sec   120.16     10.38   141.00     81.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.17m 
 75.000%   16.94m 
 90.000%   20.39m 
 99.000%   22.60m 
 99.900%   23.24m 
 99.990%   23.65m 
 99.999%   23.98m 
100.000%   24.12m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     261.503     0.000000            1         1.00
  125304.831     0.100000        43187         1.11
  258211.839     0.200000        86386         1.25
  392953.855     0.300000       129546         1.43
  532676.607     0.400000       172680         1.67
  670040.063     0.500000       215940         2.00
  740294.655     0.550000       237492         2.22
  809500.671     0.600000       259177         2.50
  878182.399     0.650000       280755         2.86
  947388.415     0.700000       302270         3.33
 1016594.431     0.750000       323810         4.00
 1050673.151     0.775000       334580         4.44
 1086324.735     0.800000       345504         5.00
 1119879.167     0.825000       356175         5.71
 1154482.175     0.850000       367093         6.67
 1189085.183     0.875000       378077         8.00
 1205862.399     0.887500       383285         8.89
 1223688.191     0.900000       388824        10.00
 1240465.407     0.912500       394012        11.43
 1258291.199     0.925000       399583        13.33
 1274019.839     0.937500       404723        16.00
 1283457.023     0.943750       407618        17.78
 1291845.631     0.950000       410240        20.00
 1300234.239     0.956250       412870        22.86
 1308622.847     0.962500       415523        26.67
 1318060.031     0.968750       418272        32.00
 1323302.911     0.971875       419711        35.56
 1328545.791     0.975000       421182        40.00
 1332740.095     0.978125       422270        45.71
 1339031.551     0.981250       423857        53.33
 1344274.431     0.984375       425146        64.00
 1346371.583     0.985938       425630        71.11
 1349517.311     0.987500       426310        80.00
 1353711.615     0.989062       427115        91.43
 1356857.343     0.990625       427675       106.67
 1361051.647     0.992188       428421       128.00
 1363148.799     0.992969       428713       142.22
 1365245.951     0.993750       429012       160.00
 1368391.679     0.994531       429416       182.86
 1371537.407     0.995313       429751       213.33
 1374683.135     0.996094       430035       256.00
 1376780.287     0.996484       430258       284.44
 1378877.439     0.996875       430441       320.00
 1379926.015     0.997266       430531       365.71
 1383071.743     0.997656       430739       426.67
 1386217.471     0.998047       430907       512.00
 1387266.047     0.998242       430944       568.89
 1389363.199     0.998437       431042       640.00
 1391460.351     0.998633       431136       731.43
 1393557.503     0.998828       431231       853.33
 1395654.655     0.999023       431301      1024.00
 1396703.231     0.999121       431329      1137.78
 1398800.383     0.999219       431383      1280.00
 1399848.959     0.999316       431414      1462.86
 1401946.111     0.999414       431459      1706.67
 1404043.263     0.999512       431499      2048.00
 1405091.839     0.999561       431522      2275.56
 1406140.415     0.999609       431542      2560.00
 1407188.991     0.999658       431555      2925.71
 1409286.143     0.999707       431584      3413.33
 1410334.719     0.999756       431602      4096.00
 1411383.295     0.999780       431607      4551.11
 1413480.447     0.999805       431625      5120.00
 1413480.447     0.999829       431625      5851.43
 1415577.599     0.999854       431639      6826.67
 1417674.751     0.999878       431651      8192.00
 1417674.751     0.999890       431651      9102.22
 1418723.327     0.999902       431657     10240.00
 1420820.479     0.999915       431666     11702.86
 1421869.055     0.999927       431670     13653.33
 1422917.631     0.999939       431672     16384.00
 1425014.783     0.999945       431675     18204.44
 1426063.359     0.999951       431677     20480.00
 1427111.935     0.999957       431681     23405.71
 1428160.511     0.999963       431685     27306.67
 1428160.511     0.999969       431685     32768.00
 1429209.087     0.999973       431687     36408.89
 1430257.663     0.999976       431689     40960.00
 1430257.663     0.999979       431689     46811.43
 1432354.815     0.999982       431691     54613.33
 1435500.543     0.999985       431692     65536.00
 1436549.119     0.999986       431693     72817.78
 1436549.119     0.999988       431693     81920.00
 1438646.271     0.999989       431694     93622.86
 1444937.727     0.999991       431696    109226.67
 1444937.727     0.999992       431696    131072.00
 1444937.727     0.999993       431696    145635.56
 1444937.727     0.999994       431696    163840.00
 1444937.727     0.999995       431696    187245.71
 1445986.303     0.999995       431697    218453.33
 1445986.303     0.999996       431697    262144.00
 1445986.303     0.999997       431697    291271.11
 1445986.303     0.999997       431697    327680.00
 1445986.303     0.999997       431697    374491.43
 1447034.879     0.999998       431698    436906.67
 1447034.879     1.000000       431698          inf
#[Mean    =   672218.360, StdDeviation   =   396917.201]
#[Max     =  1445986.304, Total count    =       431698]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  438355 requests in 30.00m, 5.80GB read
  Socket errors: connect 0, read 7982, write 14611, timeout 121475
  Non-2xx or 3xx responses: 147
Requests/sec:    243.53
Transfer/sec:      3.30MB